Repository: nayronmoura/portifolio
Catalog: lib/core/l10n/intl_*.arb
Languages: pt

# building
source: Page under construction!
pt: Página em construção!

source: About me
pt: Sobre Mim!

# aboutMeDescription
source: Hello, my name is Nayron Gabriel, I am 21 years old, and I am a Brazilian software developer with a passion for technology. With almost 3 years of experience, I have acquired solid skills in Dart, Flutter, Java, and Spring Boot. Currently, I am expanding my knowledge in native Android development. I believe technology has the power to transform the world, and I actively seek challenges that allow me to contribute to this advancement. I am always eager to learn and explore opportunities for growth. Let's build the future together!
pt: Olá, meu nome é Nayron Gabriel, tenho {years} anos e sou um desenvolvedor de software brasileiro apaixonado por tecnologia. Com quase 3 anos de experiência, adquiri sólidas habilidades em Dart, Flutter, Java e Spring Boot. Atualmente estou ampliando meus conhecimentos em desenvolvimento Android nativo. Acredito que a tecnologia tem o poder de transformar o mundo e busco ativamente desafios que me permitam contribuir para esse avanço. Estou sempre disposto a aprender e explorar oportunidades de crescimento. Vamos construir o futuro juntos!

# hiText
source: Hi there!
pt: Salve!

# welcomeText
source: Welcome to my portfolio!
pt: Seja bem-vindo ao meu Portifólio!

source: My skills
pt: Minhas Habilidades

# flutterCardDescription
source: Flutter is Googleâ€™s UI toolkit for building beautiful, natively compiled applications for mobile, web, and desktop from a single codebase.
pt: Flutter é um framework multiplataforma de código aberto criado pelo Google. Ele é usado para desenvolver aplicativos para Android, iOS, Linux, Mac, Windows, Google Fuchsia e a web a partir de uma única base de código.

# javaCardDescription
source: Java is a general-purpose, class-based, object-oriented programming language designed for having lesser implementation dependencies. It is a concurrent language and a compiled language. It is a statically typed and reflective language.
pt: Java é o famoso pau pra toda obra, é uma linguagem de programação orientada a objetos e uma plataforma de computação criada pela Sun Microsystems em 1995. Ela é uma das linguagens de programação mais usadas no mundo, especialmente para aplicativos de cliente-servidor de web.

# springCardDescription
source: Spring is an open-source application framework and inversion of control container for the Java platform. The Spring Framework provides a comprehensive infrastructure for developing Java applications.
pt: Spring Boot é um framework Java para criação de APIs RESTful. Ele é baseado no Spring Framework, mas com recursos que visam facilitar a configuração e o desenvolvimento de aplicações.

# postgresCardDescription
source: Postgres (also known as PostgreSQL) is an open-source object-relational database management system (RDBMS) that emphasizes extensibility and standards compliance. It is one of the most popular RDBMSs in the world, and is used by millions of users and organizations.
pt: PostgreSQL é um sistema de gerenciamento de banco de dados objeto-relacional (SGBDOR), desenvolvido como projeto de código aberto.

# dorminhocoDescription
source: This app is perfect for people who like to fall asleep listening to music. With Sleep Tight, you can set a timer that automatically turns off the music and Bluetooth on your phone, so you can have a good night's sleep without worrying about having to turn off the device manually.
pt: Este aplicativo é perfeito para quem gosta de adormecer ouvindo música. Com o Dorminhoco, você pode definir um timer que desliga automaticamente a música e o Bluetooth do seu celular, para que você possa ter uma boa noite de sono sem se preocupar em ter que desligar o aparelho manualmente.

# cineviewDescription
source: Cineview is an app that allows you to view movie information quickly and easily.
pt: Cineview é um aplicativo que permite visualizar informações sobre filmes de forma rápida e fácil.

# sideAboutMe
source: About me
pt: Sobre Mim

# sideProjects
source: Projects
pt: Meus Projetos

# sideSkills
source: My Skills
pt: Minhas Habilidades
